       IDENTIFICATION DIVISION.
       PROGRAM-ID. ALLCOPY.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.


      * COPY B_DTP_PAD_01_CHECKPOINT_PD1.
      * COPY B_DTP_PAD_01_CHECKPOINT_PD2.
        COPY B_DTP_PAD_01_CHECKPOINT_WS.
        COPY B_SDC_LBD_SETTB00233.
        COPY B_SDC_LBD_SETTB00494.
        COPY B_SUB_CPG_050_SUL.
        COPY B_SUB_CPG_051_SPG_R274.
        COPY B_SUB_CPG_051_SPG_R275.
        COPY B_SUB_CPG_051_SUL.
        COPY B_SUB_CPG_058_SPG_R274.
        COPY B_SUB_CPG_058_SPG_R275.
        COPY B_SUB_CPG_2K_042.
        COPY B_SUB_CPG_2K_401.
        COPY B_SUB_CPG_2K_410.
        COPY B_SUB_CPG_2K_430.
        COPY B_SUB_CPG_2K_450.
        COPY B_SUB_CPG_2K_477.
        COPY B_SUB_CPG_SPG_RUB.
      * COPY B_SUB_REN_DS_CTRL_PROC_CRED.


       PROCEDURE DIVISION.
       DISPLAY '--------------'.
       STOP RUN.
