       01 TAB-CS-RUBRICA.
         03 FILLER                    PIC X(03) VA "104".
         03 FILLER                    PIC X(03) VA "105".
         03 FILLER                    PIC X(03) VA "107".
         03 FILLER                    PIC X(03) VA "108".
         03 FILLER                    PIC X(03) VA "112".
         03 FILLER                    PIC X(03) VA "136".
         03 FILLER                    PIC X(03) VA "154".
         03 FILLER                    PIC X(03) VA "160".
         03 FILLER                    PIC X(03) VA "161".
         03 FILLER                    PIC X(03) VA "162".
         03 FILLER                    PIC X(03) VA "201".
         03 FILLER                    PIC X(03) VA "202".
         03 FILLER                    PIC X(03) VA "203".
         03 FILLER                    PIC X(03) VA "204".
         03 FILLER                    PIC X(03) VA "205".
         03 FILLER                    PIC X(03) VA "206".
         03 FILLER                    PIC X(03) VA "207".
         03 FILLER                    PIC X(03) VA "208".
         03 FILLER                    PIC X(03) VA "209".
         03 FILLER                    PIC X(03) VA "210".
         03 FILLER                    PIC X(03) VA "214".
         03 FILLER                    PIC X(03) VA "215".
         03 FILLER                    PIC X(03) VA "216".
         03 FILLER                    PIC X(03) VA "217".
         03 FILLER                    PIC X(03) VA "218".
         03 FILLER                    PIC X(03) VA "219".
         03 FILLER                    PIC X(03) VA "220".
         03 FILLER                    PIC X(03) VA "221".
         03 FILLER                    PIC X(03) VA "222".
         03 FILLER                    PIC X(03) VA "223".
         03 FILLER                    PIC X(03) VA "224".
         03 FILLER                    PIC X(03) VA "225".
         03 FILLER                    PIC X(03) VA "226".
         03 FILLER                    PIC X(03) VA "227".
         03 FILLER                    PIC X(03) VA "228".
         03 FILLER                    PIC X(03) VA "229".
         03 FILLER                    PIC X(03) VA "230".
         03 FILLER                    PIC X(03) VA "231".
         03 FILLER                    PIC X(03) VA "232".
         03 FILLER                    PIC X(03) VA "233".
         03 FILLER                    PIC X(03) VA "234".
         03 FILLER                    PIC X(03) VA "236".
         03 FILLER                    PIC X(03) VA "237".
         03 FILLER                    PIC X(03) VA "238".
         03 FILLER                    PIC X(03) VA "239".
         03 FILLER                    PIC X(03) VA "240".
         03 FILLER                    PIC X(03) VA "241".
         03 FILLER                    PIC X(03) VA "242".
         03 FILLER                    PIC X(03) VA "243".
         03 FILLER                    PIC X(03) VA "244".
         03 FILLER                    PIC X(03) VA "245".
         03 FILLER                    PIC X(03) VA "246".
         03 FILLER                    PIC X(03) VA "247".
         03 FILLER                    PIC X(03) VA "248".
         03 FILLER                    PIC X(03) VA "249".
         03 FILLER                    PIC X(03) VA "250".
         03 FILLER                    PIC X(03) VA "251".
         03 FILLER                    PIC X(03) VA "252".
         03 FILLER                    PIC X(03) VA "253".
         03 FILLER                    PIC X(03) VA "254".
         03 FILLER                    PIC X(03) VA "255".
         03 FILLER                    PIC X(03) VA "256".
         03 FILLER                    PIC X(03) VA "257".
         03 FILLER                    PIC X(03) VA "258".
         03 FILLER                    PIC X(03) VA "259".
         03 FILLER                    PIC X(03) VA "260".
         03 FILLER                    PIC X(03) VA "261".
         03 FILLER                    PIC X(03) VA "262".
         03 FILLER                    PIC X(03) VA "263".
         03 FILLER                    PIC X(03) VA "264".
         03 FILLER                    PIC X(03) VA "265".
         03 FILLER                    PIC X(03) VA "266".
         03 FILLER                    PIC X(03) VA "267".
         03 FILLER                    PIC X(03) VA "268".
         03 FILLER                    PIC X(03) VA "269".
         03 FILLER                    PIC X(03) VA "270".
         03 FILLER                    PIC X(03) VA "271".
         03 FILLER                    PIC X(03) VA "272".
         03 FILLER                    PIC X(03) VA "273".
         03 FILLER                    PIC X(03) VA "274".
         03 FILLER                    PIC X(03) VA "275".
         03 FILLER                    PIC X(03) VA "301".
         03 FILLER                    PIC X(03) VA "905".
         03 FILLER                    PIC X(03) VA "909".
         03 FILLER                    PIC X(03) VA "910".
         03 FILLER                    PIC X(03) VA "911".
         03 FILLER                    PIC X(03) VA "912".
         03 FILLER                    PIC X(03) VA "916".
         03 FILLER                    PIC X(03) VA "917".
         03 FILLER                    PIC X(03) VA "921".
         03 FILLER                    PIC X(03) VA "925".
         03 FILLER                    PIC X(03) VA "926".
         03 FILLER                    PIC X(03) VA "927".
         03 FILLER                    PIC X(03) VA "928".
         03 FILLER                    PIC X(03) VA "929".
         03 FILLER                    PIC X(03) VA "933".

         01 TAB-1-R REDEFINES TAB-CS-RUBRICA.
            03 TAB-CS-RUBR            OC 96  PIC 9(03).
